package com.hillel.lesson10;

//Зробити клас Burger, який матиме поля:
//        булочка, м'ясо, сир, зелень, майонез

//        Зробити три конструктори, які дозволятимуть робити бургери трьох видів:
//        звичайний бургер (усі компоненти)
//        дієтичний бургер (без майонезу)
//        вегетеріанський (без мя'са)
// У кожен конструктор додати виведення в консоль складу даного варіанту бургера
// (при створенні екземпляра бургера, який використовує даний конструктор - буде виводитися в консоль його склад).
// Зробити клас BurgerMain, в якому створити три різні бургери.
// Їхній склад буде автоматично виводитися на екран під час запуску програми.

public class Main {
    public static void main(String[] args) {

        Burger.burgerTypes();
//        Burger burger = new Burger("bread", "meat", "cheese", "mayonnaise", "greens");
//        Burger burger = new Burger("bread",);

//        burger.burgerType();

    }

}

